app/Models/NewsModel.php

SELECT *
FROM `news`
---
	public function getNews($slug)
	{
	    if ($slug === false)
	    {
	        return $this->findAll();